Revit 2027 API
SpacingRuleJustification Enumeration
 Justification property of spacing rule
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum SpacingRuleJustification
Public Enumeration SpacingRuleJustification
public enum class SpacingRuleJustification
type SpacingRuleJustification
Members
Member name | Value | Description
Beginning | 4
Center | 2
End | 5
See Also
Reference
Autodesk.Revit.DB Namespace